code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПравилаГенерацииНомеровСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаГенерацииНомеровСчетовДепо</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Постфикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПравилаГенерацииНомеровСчетовДепо/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает найденный по переданным параметрам постфикс из РС ПравилаГенерацииНомеровСчетовДепо
//
// Параметры:
//  Дата		 - Дата - Дата на которую нужно получить постфикс
//  СчетДепоМХ	 - СправочникСсылка.СчетаДепоМХ - СчетаДепоМХ
//  ВидСчетаДепо - ПеречислениеСсылка.ВидыСчетовДепо - ВидыСчетовДепо
//  ТипСчетаДепо - ПеречислениеСсылка.ТипыСчетовДепо - ТипыСчетовДепо
// 
// Возвращаемое значение:
//  Строка - Постфикс
//
Функция ПостфиксНаДату(Дата, СчетДепоМХ, ВидСчетаДепо, ТипСчетаДепо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаГенерацииНомеровСчетовДепоСрезПоследних.Постфикс КАК Постфикс
	|ИЗ
	|	РегистрСведений.ПравилаГенерацииНомеровСчетовДепо.СрезПоследних(
	|			&Дата,
	|			СчетДепоМХ = &СчетДепоМХ
	|				И ВидСчетаДепо = &ВидСчетаДепо
	|				И ТипСчетаДепо = &ТипСчетаДепо) КАК ПравилаГенерацииНомеровСчетовДепоСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СчетДепоМХ", СчетДепоМХ);
	Запрос.УстановитьПараметр("ВидСчетаДепо", ВидСчетаДепо);
	Запрос.УстановитьПараметр("ТипСчетаДепо", ТипСчетаДепо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Постфикс;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
